---
kind: method
id: M:Autodesk.Revit.DB.Electrical.WireTypeSet.#ctor
source: html/14a27419-d184-e98b-c9e2-e192a76bea23.htm
---
# Autodesk.Revit.DB.Electrical.WireTypeSet.#ctor Method

Initializes a new instance of the WireTypeSet class

## Syntax (C#)
```csharp
public WireTypeSet()
```